[
    "Дайте определение не копируемого класса. Когда возникает необходимость в таком классе? Напишите пример на С++.",
    "Объясните почему нежелательно использовать массивы в коде на С++. Какие классы стандартной библиотеки С++ заменяют массивы? Напишите пример кода с использованием одного из этих классов.",
    "Дайте определение абстрактного класса. Чем он отличается от интерфейса? Запишите пример определения абстрактного класса на современном С++, а также производного класса с переопределением методов.",
    "Дайте определение класса-интерфейса. Чем он отличается от абстрактного класса? Запишите пример определения интерфейса на современном С++, а также производного класса с переопределением методов.",
    "Дайте определение изоляции предметной области. Зачем нужна изоляция предметной области? Как достигается?",
    "Дайте определение карты контекстов. Как карта контекстов связана с взаимодействием команд разработки? Приведите пример.",
    "Дайте определение рефакторинга. Что такое углубляющий рефакторинг?",
    "Дайте определение ограниченного контекста. Зачем нужно это понятие? Перечислите основные виды отношений между ограниченными контекстами. Приведите пример.",
    "Дайте определение микросервиса. Опишите основные преимущества и недостатки микросервисной архитектуры. Зачем нужен мониторинг?",
    "Что такое микросервисная архитектура? Приведите пример нескольких проблемных сторон микросервисной архитектуры и предлагаемые варианты решений.",
    "Постройте модель описанной ниже предметной области, выделите сущности, значения, службы и агрегат:\nВаш отряд встречает ужасного тролля, у которого здоровье равно сумме здоровья всех ваших бойцов, сила удара и защита равны силе удара и защите самого сильного и защищённого из бойцов, соответственно, а все остальные характеристики равны минимальной из всего вашего отряда. Как победить тролля с минимальными потерями?\nВ битве урон здоровью после удара вычисляется по формуле:\n(1) Урон1 = |Защита1 + Уклонение1 – Сила_удара2 – Ловкость2|"
]